-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Arnaud\Documents\GitHub\RUME-NEEMSIS\Occupations\Stat2020.log
  log type:  text
 opened on:  15 Oct 2021, 16:15:12

. ********** Insight
. fre occupcode2020

occupcode2020
-----------------------------------------------------------------------
                          |      Freq.    Percent      Valid       Cum.
--------------------------+--------------------------------------------
Valid   1 Agri SE         |        400      15.55      15.55      15.55
        2 Agri cas        |        707      27.48      27.48      43.02
        3 Nagri cas       |        427      16.60      16.60      59.62
        4 Nagri reg nqual |        136       5.29       5.29      64.90
        5 Nagri reg qual  |        208       8.08       8.08      72.99
        6 Nagri SE        |        174       6.76       6.76      79.75
        7 NREGA           |        521      20.25      20.25     100.00
        Total             |       2573     100.00     100.00           
-----------------------------------------------------------------------

. ********** Annual income by occupation and wagetype
. stripplot annualincome10k, over(occupcode2020) separate(typewage) ///
> cumul cumprob box centre refline vertical /// 
> xsize(3) xtitle("") xlabel(,angle(45))  ///
> ylabel() ymtick() ytitle("Annual income *10k") ///
> msymbol(oh oh oh oh) mcolor(plr1 plg1 ply1 pll1) ///
> legend(pos(6) col(4)) name(inc_occ, replace)

. graph export "$git\Occupations\income_2020.pdf", replace
(file C:\Users\Arnaud\Documents\GitHub\RUME-NEEMSIS\Occupations\income_2020.pdf written in PDF format)

. stripplot annualincome10k if annualincome10k<50, over(occupcode2020) separate(typewage) ///
> cumul cumprob box centre refline vertical /// 
> xsize(3) xtitle("") xlabel(,angle(45))  ///
> ylabel() ymtick() ytitle("Annual income *10k") ///
> msymbol(oh oh oh oh) mcolor(plr1 plg1 ply1 pll1) ///
> legend(pos(6) col(4)) name(inc_occ_50, replace)

. graph export "$git\Occupations\income50_2020.pdf", replace
(file C:\Users\Arnaud\Documents\GitHub\RUME-NEEMSIS\Occupations\income50_2020.pdf written in PDF format)

. ********** Education
. tab occupcode2020 edulevel, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |                             edulevel
  occupcode2020 | Below pri  Primary c  High scho  HSC/Diplo  Bachelors  Post grad |     Total
----------------+------------------------------------------------------------------+----------
        Agri SE |     39.25      19.25      26.75       8.25       4.25       2.25 |    100.00 
                |     15.27      17.46      16.41      12.60      13.28      15.79 |     15.58 
----------------+------------------------------------------------------------------+----------
       Agri cas |     55.02      18.67      20.65       4.67       0.71       0.28 |    100.00 
                |     37.84      29.93      22.39      12.60       3.91       3.51 |     27.53 
----------------+------------------------------------------------------------------+----------
      Nagri cas |     30.59      18.12      36.24       9.88       4.24       0.94 |    100.00 
                |     12.65      17.46      23.62      16.03      14.06       7.02 |     16.55 
----------------+------------------------------------------------------------------+----------
Nagri reg nqual |     17.04      22.96      36.30      13.33       5.93       4.44 |    100.00 
                |      2.24       7.03       7.52       6.87       6.25      10.53 |      5.26 
----------------+------------------------------------------------------------------+----------
 Nagri reg qual |      2.90       0.00      18.36      30.43      33.82      14.49 |    100.00 
                |      0.58       0.00       5.83      24.05      54.69      52.63 |      8.06 
----------------+------------------------------------------------------------------+----------
       Nagri SE |     21.26      22.41      32.76      18.39       2.30       2.87 |    100.00 
                |      3.60       8.84       8.74      12.21       3.13       8.77 |      6.78 
----------------+------------------------------------------------------------------+----------
          NREGA |     55.00      16.35      19.42       7.88       1.15       0.19 |    100.00 
                |     27.82      19.27      15.49      15.65       4.69       1.75 |     20.25 
----------------+------------------------------------------------------------------+----------
          Total |     40.03      17.17      25.39      10.20       4.98       2.22 |    100.00 
                |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 


. ********** Type of wage
. tab occupcode2020 typewage, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |                  typewage
  occupcode2020 |   Agri SE         SE   Perm/fix   Day/Seas |     Total
----------------+--------------------------------------------+----------
        Agri SE |     61.00       0.00       2.75      36.25 |    100.00 
                |     98.79       0.00       1.29      11.12 |     15.55 
----------------+--------------------------------------------+----------
       Agri cas |      0.28       0.00       2.12      97.60 |    100.00 
                |      0.81       0.00       1.76      52.91 |     27.49 
----------------+--------------------------------------------+----------
      Nagri cas |      0.00       0.00       0.00     100.00 |    100.00 
                |      0.00       0.00       0.00      32.75 |     16.60 
----------------+--------------------------------------------+----------
Nagri reg nqual |      0.00       0.00      98.53       1.47 |    100.00 
                |      0.00       0.00      15.71       0.15 |      5.29 
----------------+--------------------------------------------+----------
 Nagri reg qual |      0.00       0.00      98.55       1.45 |    100.00 
                |      0.00       0.00      23.92       0.23 |      8.05 
----------------+--------------------------------------------+----------
       Nagri SE |      0.00      96.55       0.57       2.87 |    100.00 
                |      0.00     100.00       0.12       0.38 |      6.77 
----------------+--------------------------------------------+----------
          NREGA |      0.19       0.00      93.67       6.14 |    100.00 
                |      0.40       0.00      57.21       2.45 |     20.26 
----------------+--------------------------------------------+----------
          Total |      9.60       6.53      33.16      50.70 |    100.00 
                |    100.00     100.00     100.00     100.00 |    100.00 


. ********** Caste
. tab occupcode2020 caste, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |              caste
  occupcode2020 |    Dalits     Middle      Upper |     Total
----------------+---------------------------------+----------
        Agri SE |     32.50      60.00       7.50 |    100.00 
                |     10.03      22.14      15.63 |     15.55 
----------------+---------------------------------+----------
       Agri cas |     62.38      35.64       1.98 |    100.00 
                |     34.03      23.25       7.29 |     27.49 
----------------+---------------------------------+----------
      Nagri cas |     53.99      38.73       7.28 |    100.00 
                |     17.75      15.22      16.15 |     16.56 
----------------+---------------------------------+----------
Nagri reg nqual |     48.53      30.15      21.32 |    100.00 
                |      5.09       3.78      15.10 |      5.29 
----------------+---------------------------------+----------
 Nagri reg qual |     46.15      39.42      14.42 |    100.00 
                |      7.41       7.56      15.63 |      8.09 
----------------+---------------------------------+----------
       Nagri SE |     45.98      43.10      10.92 |    100.00 
                |      6.17       6.92       9.90 |      6.77 
----------------+---------------------------------+----------
          NREGA |     48.56      43.95       7.49 |    100.00 
                |     19.52      21.13      20.31 |     20.26 
----------------+---------------------------------+----------
          Total |     50.39      42.15       7.47 |    100.00 
                |    100.00     100.00     100.00 |    100.00 


. ********** Sex
. tab occupcode2020 sex, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |          sex
  occupcode2020 |      Male     Female |     Total
----------------+----------------------+----------
        Agri SE |     60.50      39.50 |    100.00 
                |     18.24      12.69 |     15.55 
----------------+----------------------+----------
       Agri cas |     48.23      51.77 |    100.00 
                |     25.70      29.40 |     27.49 
----------------+----------------------+----------
      Nagri cas |     67.61      32.39 |    100.00 
                |     21.70      11.08 |     16.56 
----------------+----------------------+----------
Nagri reg nqual |     69.12      30.88 |    100.00 
                |      7.08       3.37 |      5.29 
----------------+----------------------+----------
 Nagri reg qual |     80.77      19.23 |    100.00 
                |     12.66       3.21 |      8.09 
----------------+----------------------+----------
       Nagri SE |     79.89      20.11 |    100.00 
                |     10.47       2.81 |      6.77 
----------------+----------------------+----------
          NREGA |     10.56      89.44 |    100.00 
                |      4.14      37.43 |     20.26 
----------------+----------------------+----------
          Total |     51.59      48.41 |    100.00 
                |    100.00     100.00 |    100.00 


. ********** Sector
. tab occupcode2020 occup_sector2, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |                                                 occup_sector2
  occupcode2020 | Cultivato  Agricultu  Productio  Most qual  Administr  Clerical   Merchents  Service w  Artists a      NREGA |     Total
----------------+--------------------------------------------------------------------------------------------------------------+----------
        Agri SE |    100.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00 |    100.00 
                |    100.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00 |     15.76 
----------------+--------------------------------------------------------------------------------------------------------------+----------
       Agri cas |      0.00     100.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00 |    100.00 
                |      0.00      99.44       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00 |     27.89 
----------------+--------------------------------------------------------------------------------------------------------------+----------
      Nagri cas |      0.00       0.00      81.95       0.00       0.00       0.49       7.56      10.00       0.00       0.00 |    100.00 
                |      0.00       0.00      60.00       0.00       0.00       5.56      20.00      48.24       0.00       0.00 |     16.20 
----------------+--------------------------------------------------------------------------------------------------------------+----------
Nagri reg nqual |      0.00       0.00      39.34       0.82       0.00       3.28      35.25      21.31       0.00       0.00 |    100.00 
                |      0.00       0.00       8.57       2.78       0.00      11.11      27.74      30.59       0.00       0.00 |      4.82 
----------------+--------------------------------------------------------------------------------------------------------------+----------
 Nagri reg qual |      0.00       0.00      59.13      16.83       8.17      14.42       1.44       0.00       0.00       0.00 |    100.00 
                |      0.00       0.00      21.96      97.22     100.00      83.33       1.94       0.00       0.00       0.00 |      8.22 
----------------+--------------------------------------------------------------------------------------------------------------+----------
       Nagri SE |      0.00       2.42      32.12       0.00       0.00       0.00      47.27      10.91       7.27       0.00 |    100.00 
                |      0.00       0.56       9.46       0.00       0.00       0.00      50.32      21.18     100.00       0.00 |      6.52 
----------------+--------------------------------------------------------------------------------------------------------------+----------
          NREGA |      0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00     100.00 |    100.00 
                |      0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00       0.00     100.00 |     20.58 
----------------+--------------------------------------------------------------------------------------------------------------+----------
          Total |     15.76      28.05      22.13       1.42       0.67       1.42       6.12       3.36       0.47      20.58 |    100.00 
                |    100.00     100.00     100.00     100.00     100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 


. ********** Kow
. tab occupcode2020 kindofwork, row col nofreq

+-------------------+
| Key               |
|-------------------|
|  row percentage   |
| column percentage |
+-------------------+

                |              ${namefromearlier3}: What kind of work is ${occupationname}?
  occupcode2020 |   Agri SE         SE    SJ agri   SJ nagri  UW hh bus  UW oth bu  UW own ag  UW oth ag |     Total
----------------+----------------------------------------------------------------------------------------+----------
        Agri SE |     61.00       0.00       2.50       0.75       0.25       0.25      34.25       1.00 |    100.00 
                |     98.79       0.00       1.22       0.26      10.00      11.11      95.14      66.67 |     15.55 
----------------+----------------------------------------------------------------------------------------+----------
       Agri cas |      0.28       0.00      94.91       3.54       0.14       0.14       0.85       0.14 |    100.00 
                |      0.81       0.00      81.93       2.14      10.00      11.11       4.17      16.67 |     27.48 
----------------+----------------------------------------------------------------------------------------+----------
      Nagri cas |      0.00       0.00       9.60      87.82       1.87       0.47       0.23       0.00 |    100.00 
                |      0.00       0.00       5.01      32.05      80.00      22.22       0.69       0.00 |     16.60 
----------------+----------------------------------------------------------------------------------------+----------
Nagri reg nqual |      0.00       0.00       0.74      95.59       0.00       3.68       0.00       0.00 |    100.00 
                |      0.00       0.00       0.12      11.11       0.00      55.56       0.00       0.00 |      5.29 
----------------+----------------------------------------------------------------------------------------+----------
 Nagri reg qual |      0.00       0.00       2.40      97.60       0.00       0.00       0.00       0.00 |    100.00 
                |      0.00       0.00       0.61      17.35       0.00       0.00       0.00       0.00 |      8.08 
----------------+----------------------------------------------------------------------------------------+----------
       Nagri SE |      0.00      96.55       0.57       2.87       0.00       0.00       0.00       0.00 |    100.00 
                |      0.00     100.00       0.12       0.43       0.00       0.00       0.00       0.00 |      6.76 
----------------+----------------------------------------------------------------------------------------+----------
          NREGA |      0.19       0.00      17.27      82.34       0.00       0.00       0.00       0.19 |    100.00 
                |      0.40       0.00      10.99      36.67       0.00       0.00       0.00      16.67 |     20.25 
----------------+----------------------------------------------------------------------------------------+----------
          Total |      9.60       6.53      31.83      45.47       0.39       0.35       5.60       0.23 |    100.00 
                |    100.00     100.00     100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 


. 
. log close
      name:  <unnamed>
       log:  C:\Users\Arnaud\Documents\GitHub\RUME-NEEMSIS\Occupations\Stat2020.log
  log type:  text
 closed on:  15 Oct 2021, 16:15:14
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
